### luis jaramillo uday
##### https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html

In [40]:
import pandas as pd
import sys
import datetime as dt
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
##from pandas.tools.plotting import radviz##

%matplotlib inline

In [57]:
mi_df = pd.DataFrame(({'a': [11,12,13], 'b': [21,22,23], 'c': [7,17,25]}))
print  (mi_df)

    a   b   c
0  11  21   7
1  12  22  17
2  13  23  25

In [59]:
data = {'ciudad': ['Loja', 'Pichincha', 'Guayas'],
        'capital' : ['Loja', 'Quito', 'Guayaquil'],
        'Nºcantones' : [16,8,25],
        'zona'  : [7, 8, 1]}
frame = pd.DataFrame(data) # Creando un DataFrame desde un diccionario
frame

      ciudad    capital  Nºcantones  zona
0       Loja       Loja          16     7
1  Pichincha      Quito           8     8
2     Guayas  Guayaquil          25     1

In [60]:
columnas = ['nombres','apellidos','cedula','ciudad']

In [62]:
lista = [['rene', 'elizalde', '11041260','loja'],
        ['rolando', 'solano', '11041261','quito'],
        ['alexis', 'montoya', '1152362536','guayaquil'],
        ['marco', 'briceño', '1178523698','cuenca'],
        ['daniel', 'ulloa', '1715369852','machal'],]

In [63]:
data = pd.DataFrame(lista, columns=columnas)

In [64]:
data

   nombres apellidos      cedula     ciudad
0     rene  elizalde    11041260       loja
1  rolando    solano    11041261      quito
2   alexis   montoya  1152362536  guayaquil
3    marco   briceño  1178523698     cuenca
4   daniel     ulloa  1715369852     machal

In [68]:
lista2 =[['rene', 'elizalde', '11041260','loja'],
        ['rolando', 'solano', '11041261','quito'],]

In [69]:
data2 = pd.DataFrame(lista2, columns=columnas)

In [70]:
data2

   nombres apellidos    cedula ciudad
0     rene  elizalde  11041260   loja
1  rolando    solano  11041261  quito

In [71]:
data3 = pd.concat([data, data2])

In [72]:
data3

   nombres apellidos      cedula     ciudad
0     rene  elizalde    11041260       loja
1  rolando    solano    11041261      quito
2   alexis   montoya  1152362536  guayaquil
3    marco   briceño  1178523698     cuenca
4   daniel     ulloa  1715369852     machal
0     rene  elizalde    11041260       loja
1  rolando    solano    11041261      quito

In [52]:
data5 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263', '11041266'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito', 'Loja'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha', 'Loja']})

In [53]:
data5

     cedula     Ciudad  Provincia
0  11041260  Guayaquil     Guayas
1  11041261     Cuenca      Azuay
2  11041263      Quito  Pichincha
3  11041266       Loja       Loja

In [54]:
result = pd.merge(data3, data5, on='cedula')

In [55]:
result

   nombres  apellidos    cedula     Ciudad  Provincia
0     rene   elizalde  11041260  Guayaquil     Guayas
1  rolando     solano  11041261     Cuenca      Azuay
2    rene2  elizalde2  11041263      Quito  Pichincha

In [56]:
data6 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha']})
data6

     cedula     Ciudad  Provincia
0  11041260  Guayaquil     Guayas
1  11041261     Cuenca      Azuay
2  11041263      Quito  Pichincha

In [73]:
data9 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263', '11041266'],
 	'Nombre': ['luis', 'alexis', 'daniel', 'marco'],
	'apellido': ['jaramillo', 'montoya', 'ulloa', 'briceño']})

In [74]:
data10 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263', '11041266'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito','cuenca'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha','azuay']})
data10

     cedula     Ciudad  Provincia
0  11041260  Guayaquil     Guayas
1  11041261     Cuenca      Azuay
2  11041263      Quito  Pichincha
3  11041266     cuenca      azuay

In [75]:
result = pd.merge(data9, data10, on='cedula')

In [76]:
result

     cedula  Nombre   apellido     Ciudad  Provincia
0  11041260    luis  jaramillo  Guayaquil     Guayas
1  11041261  alexis    montoya     Cuenca      Azuay
2  11041263  daniel      ulloa      Quito  Pichincha
3  11041266   marco    briceño     cuenca      azuay